In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: six in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython-sql) (1.14.0)
Collecting sqlalchemy>=0.6.7
  Downloading SQLAlchemy-1.4.39-cp38-cp38-macosx_10_15_x86_64.whl (1.5 MB)
     |████████████████████████████████| 1.5 MB 2.2 MB/s
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
     |████████████████████████████████| 42 kB 2.0 MB/s
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (3.0.9)
Requirement already satisfied: pickleshare in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: backcall in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pexpect>4.3 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: appnope in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: setuptools>=18.5 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (41.2.0)
Requirement already satisfied: decorator in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (2.7.3)
Requirement already satisfied: traitlets>=4.2 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp38-cp38-macosx_10_14_x86_64.whl (92 kB)
     |████████████████████████████████| 92 kB 1.1 MB/s
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: ptyprocess>=0.5 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Using legacy 'setup.py install' for prettytable, since package 'wheel' is not installed.
Installing collected packages: greenlet, sqlparse, sqlalchemy, prettytable, ipython-sql
    Running setup.py install for prettytable ... done
Successfully installed greenlet-1.1.2 ipython-sql-0.4.1 prettytable-0.7.2 sqlalchemy-1.4.39 sqlparse-0.4.2
WARNING: You are using pip version 21.3.1; however, version 22.1.2 is available.
You should consider upgrading via the '/Library/Frameworks/Python.framework/Versions/3.8/bin/python3.8 -m pip install --upgrade pip' command.

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [3]:
%%sql

CREATE TABLE sales (
  "customer_id" VARCHAR(1),
  "order_date" DATE,
  "product_id" INTEGER
);

INSERT INTO sales
  ("customer_id", "order_date", "product_id")
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');
 

CREATE TABLE menu (
  "product_id" INTEGER,
  "product_name" VARCHAR(5),
  "price" INTEGER
);

INSERT INTO menu
  ("product_id", "product_name", "price")
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');
  

CREATE TABLE members (
  "customer_id" VARCHAR(1),
  "join_date" DATE
);

INSERT INTO members
  ("customer_id", "join_date")
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

 * sqlite://
Done.
15 rows affected.
Done.
3 rows affected.
Done.
2 rows affected.

[]

/* --------------------
   Case Study Questions
   --------------------*/

-- 1. What is the total amount each customer spent at the restaurant?
-- 2. How many days has each customer visited the restaurant?
-- 3. What was the first item from the menu purchased by each customer?
-- 4. What is the most purchased item on the menu and how many times was it purchased by all customers?
-- 5. Which item was the most popular for each customer?
-- 6. Which item was purchased first by the customer after they became a member?
-- 7. Which item was purchased just before the customer became a member?
-- 8. What is the total items and amount spent for each member before they became a member?
-- 9.  If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
-- 10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [11]:
%%sql
SELECT * 
FROM sales;

 * sqlite://
Done.

[('A', '2021-01-01', 1),
 ('A', '2021-01-01', 2),
 ('A', '2021-01-07', 2),
 ('A', '2021-01-10', 3),
 ('A', '2021-01-11', 3),
 ('A', '2021-01-11', 3),
 ('B', '2021-01-01', 2),
 ('B', '2021-01-02', 2),
 ('B', '2021-01-04', 1),
 ('B', '2021-01-11', 1),
 ('B', '2021-01-16', 3),
 ('B', '2021-02-01', 3),
 ('C', '2021-01-01', 3),
 ('C', '2021-01-01', 3),
 ('C', '2021-01-07', 3)]

In [12]:
%%sql
SELECT * 
FROM menu;

 * sqlite://
Done.

[(1, 'sushi', 10), (2, 'curry', 15), (3, 'ramen', 12)]

In [13]:
%%sql
SELECT * 
FROM members;

 * sqlite://
Done.

[('A', '2021-01-07'), ('B', '2021-01-09')]

# Question 1: What is the total amount each customer spent at the restaurant?

In [17]:
%%sql
SELECT sales.customer_id,
    SUM(menu.price) AS total_spent
FROM sales
LEFT JOIN menu
ON sales.product_id = menu.product_id
GROUP BY sales.customer_id;

 * sqlite://
Done.

[('A', 76), ('B', 74), ('C', 36)]

# Question 2: How many days has each customer visited the restaurant?

In [19]:
%%sql
SELECT customer_id,
    COUNT(DISTINCT order_date) AS num_days_visited
FROM sales
GROUP BY customer_id;

 * sqlite://
Done.

[('A', 4), ('B', 6), ('C', 2)]

# Question 3: What was the first item from the menu purchased by each customer?

In [69]:
%%sql
WITH ranked_orders AS (
    SELECT DENSE_RANK() OVER(PARTITION BY customer_id ORDER BY order_date) AS rank,
        customer_id,
        order_date,
        product_name
    FROM sales
    LEFT JOIN menu
    ON sales.product_id = menu.product_id)

SELECT customer_id,
       product_name
FROM ranked_orders
WHERE rank = 1
GROUP BY customer_id, product_name;

 * sqlite://
Done.

[('A', 'curry'), ('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

# Question 4: What is the most purchased item on the menu and how many times was it purchased by all customers?

In [48]:
%%sql
SELECT product_name,
    MAX(times_ordered)
FROM (SELECT sales.product_id,
      menu.product_name,
      COUNT(*) AS times_ordered
      FROM sales
      LEFT JOIN menu
      ON sales.product_id = menu.product_id
      GROUP BY sales.product_id);

 * sqlite://
Done.

[('ramen', 8)]

# Question 5: Which item was the most popular for each customer?

In [71]:
%%sql
WITH ranked_items AS (
    SELECT sales.customer_id, 
           menu.product_name,
           COUNT(menu.product_id) AS order_count,
           DENSE_RANK() OVER(PARTITION BY sales.customer_id ORDER BY COUNT(sales.customer_id) DESC) AS rank
    FROM menu
    JOIN sales
    ON menu.product_id = sales.product_id
    GROUP BY sales.customer_id, menu.product_name)

SELECT customer_id, product_name, order_count
FROM ranked_items 
WHERE rank = 1;

 * sqlite://
Done.

[('A', 'ramen', 3),
 ('B', 'curry', 2),
 ('B', 'ramen', 2),
 ('B', 'sushi', 2),
 ('C', 'ramen', 3)]

# Question 6: Which item was purchased first by the customer after they became a member?

In [9]:
%%sql
WITH member_sales AS (
    SELECT DENSE_RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date) AS rank,
        s.customer_id,
        s.order_date,
        m.join_date,
        s.product_id
    FROM sales AS s
    LEFT JOIN members AS m
    ON s.customer_id = m.customer_id
    WHERE s.order_date>=m.join_date)

SELECT customer_id, 
       order_date,
       product_name AS first_member_order
    FROM member_sales
    LEFT JOIN menu
    ON member_sales.product_id=menu.product_id
    WHERE rank = 1;

 * sqlite://
Done.

[('A', '2021-01-07', 'curry'), ('B', '2021-01-11', 'sushi')]

# Question 7: Which item was purchased just before the customer became a member?

In [11]:
%%sql
WITH non_member_sales AS (
    SELECT DENSE_RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date DESC) AS rank,
        s.customer_id,
        s.order_date,
        m.join_date,
        s.product_id
    FROM sales AS s
    LEFT JOIN members AS m
    ON s.customer_id = m.customer_id
    WHERE s.order_date < m.join_date)

SELECT customer_id, 
       order_date,
       product_name AS last_non_member_order
    FROM non_member_sales
    LEFT JOIN menu
    ON non_member_sales.product_id=menu.product_id
    WHERE rank = 1;

 * sqlite://
Done.

[('A', '2021-01-01', 'sushi'),
 ('A', '2021-01-01', 'curry'),
 ('B', '2021-01-04', 'sushi')]

# Question 8: What is the total items and amount spent for each member before they became a member?

In [13]:
%%sql
WITH non_member_sales AS (
    SELECT s.customer_id,
           s.order_date,
           m.join_date,
           s.product_id
    FROM sales AS s
    LEFT JOIN members AS m
    ON s.customer_id = m.customer_id
    WHERE s.order_date < m.join_date)

SELECT nms.customer_id,
       COUNT(nms.order_date) AS total_items,
       SUM(m2.price) AS amount_spent
FROM non_member_sales AS nms
LEFT JOIN menu AS m2
ON nms.product_id = m2.product_id
GROUP BY nms.customer_id;

 * sqlite://
Done.

[('A', 2, 25), ('B', 3, 40)]

# Question 9: If each 1 dollar spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [29]:
%%sql
WITH points AS (
    SELECT *,
           CASE WHEN product_id = 1 THEN price * 20
           ELSE price * 10 END AS total_points
    FROM menu)


SELECT s.customer_id,
       SUM(p.total_points) AS total_points
    FROM sales AS s
    LEFT JOIN points AS p
    ON s.product_id = p.product_id
    GROUP BY s.customer_id;

 * sqlite://
Done.

[('A', 860), ('B', 940), ('C', 360)]

# Question 10: In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [38]:
%%sql
WITH valid_dates AS (
    SELECT *, 
           DATE(join_date, '6 days') AS valid_date, 
           DATE(join_date,'start of month','+1 month','-1 day') AS last_date
    FROM members AS m)

SELECT s.customer_id,
       SUM(CASE WHEN s.order_date < v.join_date AND m.product_id = 1 THEN m.price * 20
       WHEN s.order_date BETWEEN v.join_date AND v.valid_date THEN m.price * 20
       ELSE m.price * 10 END) AS points
FROM sales AS s
JOIN valid_dates AS v
ON s.customer_id = v.customer_id
JOIN menu AS m
ON s.product_id = m.product_id
GROUP BY s.customer_id;

 * sqlite://
Done.

[('A', 1370), ('B', 940)]